Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: To save memory the options can be set from a static (const) string as well with :cpp:expr:`lv_dropdown_set_options_static(dropdown, options)`.
it_it: Per risparmiare memoria, le opzioni possono essere impostate anche da una stringa statica (const) con :cpp:expr:`lv_dropdown_set_options_static(dropdown, options)`.

source: To save memory, LVGL can render certain types of layers in smaller chunks:
it_it: Per risparmiare memoria, LVGL può eseguire il rendering di alcuni tipi di layer in blocchi più piccoli:

source: To save memory, widgets store these flags in a bitfield.
it_it: Per risparmiare memoria, i widget memorizzano questi flag in un bitfield.

source: To search for a string pattern in the configuration, press ``/`` followed by the desired pattern.
it_it: Per cercare un pattern di stringhe nella configurazione, premere ``/`` seguito dal pattern desiderato.

source: To see a list of options available:
it_it: Per visualizzare un elenco delle opzioni disponibili:

source: To see a list of the options BitBake supports, use either of the following commands::
it_it: Per visualizzare un elenco delle opzioni supportate da BitBake, utilizzare uno dei seguenti comandi:

source: To see the full API for any widget, see its documentation at :ref:`widgets`, or check its related header file in the source code.
it_it: Per visualizzare l'API completa di un widget, consultare la relativa documentazione in :ref:`widgets` o controllare il relativo file header nel codice sorgente.

source: To see the full list, check out :ref:`indev_events`.
it_it: Per visualizzare l'elenco completo, consultare :ref:`indev_events`.

source: To see whether the current call is for the last chunk being rendered, use :cpp:expr:`lv_display_flush_is_last(display1)`.
it_it: Per verificare se la chiamata corrente riguarda l'ultimo blocco in fase di rendering, si usa :cpp:expr:`lv_display_flush_is_last(display1)`.

source: To select a new tab you can:
it_it: Per selezionare una nuova scheda si può:

source: To set a Screen to be the "Active Screen", call :cpp:func:`lv_screen_load` or :cpp:func:`lv_screen_load_anim`.
it_it: Per impostare uno Screen come "Screen Attivo", si chiama :cpp:func:`lv_screen_load` o :cpp:func:`lv_screen_load_anim`.

source: To set a Screen you create to be the :ref:`active_screen`, call :cpp:func:`lv_screen_load` or :cpp:func:`lv_screen_load_anim`.
it_it: Per impostare uno Schermo creato come :ref:`active_screen`, si chiama :cpp:func:`lv_screen_load` o :cpp:func:`lv_screen_load_anim`.

source: To set a Widget's base direction use :cpp:expr:`lv_obj_set_style_base_dir(widget, base_dir, selector)`.
it_it: Per impostare la direzione di base di un Widget, si usa :cpp:expr:`lv_obj_set_style_base_dir(widget, base_dir, selector)`.

source: To set a control map for a Button Matrix (similar to `Button map`_), use
it_it: Per impostare una mappa di controllo per una Button Matrix (simile a `Button map`_), si usa

source: To set a local property use functions like ``lv_obj_set_style_<property_name>(widget, <value>, <selector>);`` For example:
it_it: Per impostare una proprietà locale, utilizzare funzioni come ``lv_obj_set_style_<property_name>(widget, <value>, <selector>);`` Per esempio:

source: To set a theme for a display, two steps are required:
it_it: Per impostare un tema per un display, sono necessari due passaggi:

source: To set an individual pixel's color on the Canvas, use :cpp:expr:`lv_canvas_set_px(canvas, x, y, color, opa)`.
it_it: Per impostare il colore di un singolo pixel sul Canvas, si usa :cpp:expr:`lv_canvas_set_px(canvas, x, y, color, opa)`.

source: To set and clear a button's control flags, use
it_it: Per impostare e cancellare i flag di controllo di un pulsante, utilizzare

source: To set and clear the same control attribute for all buttons in a Button Matrix, use
it_it: Per impostare e cancellare lo stesso attributo di controllo per tutti i pulsanti in una Button Matrix, usare

source: To set another :ref:`display` as the Default Display, call :cpp:func:`lv_display_set_default`.
it_it: Per impostare un altro :ref:`display` come Display di Default, si chiama :cpp:func:`lv_display_set_default`.

source: To set different values use:
it_it: Per impostare valori diversi, utilizzare:

source: To set or clear a given state (while leaving other states untouched), use:
it_it: Per impostare o cancellare un determinato stato (lasciando inalterati gli altri stati), utilizzare:

source: To set static text, use :cpp:expr:`lv_checkbox_set_text_static(cb, txt)`.
it_it: Per impostare un testo statico, utilizzare :cpp:expr:`lv_checkbox_set_text_static(cb, txt)`.

source: To set the current date (today), use the :cpp:expr:`lv_calendar_set_today_date(calendar, year, month, day)` function.
it_it: Per impostare la data corrente (today), utilizzare la funzione :cpp:expr:`lv_calendar_set_today_date(calendar, year, month, day)`.

source: To set the descriptors on a parent use :cpp:expr:`lv_obj_set_grid_dsc_array(widget, col_dsc, row_dsc)`.
it_it: Per impostare i descrittori su un elemento padre, si usa :cpp:expr:`lv_obj_set_grid_dsc_array(widget, col_dsc, row_dsc)`.

source: To set the image animation image sources, use :cpp:expr:`lv_animimg_set_src(animimg, dsc[], num)`.
it_it: Per impostare le sorgenti delle immagini animate, utilizzare :cpp:expr:`lv_animimg_set_src(animimg, dsc[], num)`.

source: To set the image in a state, use the :cpp:expr:`lv_imagebutton_set_src(imagebutton, LV_IMAGEBUTTON_STATE_..., src_left, src_mid, src_right)`.
it_it: Per impostare l'immagine in uno stato, si usa :cpp:expr:`lv_imagebutton_set_src(imagebutton, LV_IMAGEBUTTON_STATE_..., src_left, src_mid, src_right)`.

source: To set the images source for flip playback of animation image, use :cpp:expr:`lv_animimg_set_src_reverse(animimg, dsc[], num)`.
it_it: Per impostare la sorgente delle immagini per la riproduzione al contrario dell'immagine animata, si usa :cpp:expr:`lv_animimg_set_src_reverse(animimg, dsc[], num)`.

source: To set the mode manually, use :cpp:expr:`lv_ime_pinyin_set_mode(pinyin_ime, mode)`.
it_it: Per impostare manualmente la modalità, si usa :cpp:expr:`lv_ime_pinyin_set_mode(pinyin_ime, mode)`.

source: To set the mode programmatically, use :cpp:expr:`lv_keyboard_set_mode(kb, mode)`.
it_it: Per impostare la modalità da codice, si usa :cpp:expr:`lv_keyboard_set_mode(kb, mode)`.

source: To set the resolution of the display after creation use :cpp:expr:`lv_display_set_resolution(display, hor_res, ver_res)`
it_it: Per impostare la risoluzione del display dopo la creazione, si usa :cpp:expr:`lv_display_set_resolution(display, hor_res, ver_res)`

source: To set the shown date, use :cpp:expr:`lv_calendar_set_month_shown(calendar, year, month)`
it_it: Per impostare la data visualizzata, si usa :cpp:expr:`lv_calendar_set_month_shown(calendar, year, month)`

source: To set the source of an image, use :cpp:expr:`lv_image_set_src(img, src)`.
it_it: Per impostare la sorgente di un'immagine, si usa :cpp:expr:`lv_image_set_src(img, src)`.

source: To set the start and end angle of the background Arc use any of these functions:
it_it: Per impostare l'angolo iniziale e finale dell'Arco sullo sfondo, utilizzare una di queste funzioni:

source: To set the track's alignment use :cpp:expr:`lv_obj_set_grid_align(widget, column_align, row_align)`.
it_it: Per impostare l'allineamento della track, si usa :cpp:expr:`lv_obj_set_grid_align(widget, column_align, row_align)`.

source: To set up a framebuffer-based display, first create a display with ``lv_linux_fbdev_create``.
it_it: Per impostare un display basato su framebuffer, creare prima un display con ``lv_linux_fbdev_create``.

source: To set up an event input, first create an input device with ``lv_edev_create`` setting it to the correct Linux event device.
it_it: Per impostare un input di evento, creare prima un "input device" con ``lv_edev_create`` impostandolo sul dispositivo di eventi Linux corretto.

source: To set up an input device via the libinput driver, all you need to do is call ``lv_libinput_create`` with the respective device type (``LV_INDEV_TYPE_POINTER`` or ``LV_INDEV_TYPE_KEYPAD``) and device node path (e.g. ``/dev/input/event5``).
it_it: Per impostare un dispositivo di input tramite il driver libinput, è sufficiente chiamare ``lv_libinput_create`` on il rispettivo tipo di dispositivo (``LV_INDEV_TYPE_POINTER`` o ``LV_INDEV_TYPE_KEYPAD``) e il path del nodo del dispositivo (ad esempio ``/dev/input/event5``).

source: To set up the environment
it_it: Per configurare l'ambiente

source: To set up your development environment refer to the `getting started guide <https://docs.zephyrproject.org/latest/develop/getting_started/index.html>`__.
it_it: Per configurare l'ambiente di sviluppo, consultare la `guida introduttiva <https://docs.zephyrproject.org/latest/develop/getting_started/index.html>`__.

source: To show the cursor, its location must be set by you programmatically using one of the functions below.
it_it: Per visualizzare il cursore, la sua posizione deve essere impostata da programma utilizzando una delle funzioni seguenti.

source: To simplify this, *subject set* and *increment* actions can be attached directly to any widget.
it_it: Per semplificare, le azioni *subject set* e *increment* possono essere associate direttamente a qualsiasi widget.

source: To skip the palette, include the following line in your :ref:`flush_callback` function: ``px_map += 8``.
it_it: Per saltare la palette, includere la seguente riga nella funzione :ref:`flush_callback`: ``px_map += 8``.

source: To solve this, you can write an event-driven driver for your input device that buffers measured data.
it_it: Per risolvere questo problema, è possibile scrivere un driver event-driven per il dispositivo di input che memorizzi i dati misurati nel buffer.

source: To squeeze them down to make them more readable and usable, move your existing table under a ..
it_it: Per ridurle e renderle più leggibili e utilizzabili, spostare la tabella esistente sotto una direttiva ..

source: To subscribe to a Subject one of the ``lv_subject_add_observer...()`` functions are used.
it_it: Per iscriversi a un Subject si utilizza una delle funzioni ``lv_subject_add_observer...()``.

source: To support the auto-generation of bindings, the LVGL C API must follow some coding conventions:
it_it: Per supportare la generazione automatica dei binding, l'API C LVGL deve seguire alcune convenzioni di codifica:

source: To target a slot on an instance of a component create a child like ``<component_name-slot_name>`` and add the children as needed.
it_it: Per assegnare uno slot a un'istanza di un componente, creare un elemento figlio come ``<component_name-slot_name>`` e aggiungere gli elementi figlio secondo necessità.

source: To terminate the command list you must use a delay with a value of ``LV_LCD_CMD_EOF``, as shown above.
it_it: Per terminare l'elenco dei comandi, è necessario utilizzare un ritardo con valore ``LV_LCD_CMD_EOF``, come mostrato sopra.

source: To test if your device is set up correctly for use with libinput, you can run ``libinput list-devices``.
it_it: Per verificare se il dispositivo è configurato correttamente per l'utilizzo con libinput, è possibile eseguire ``libinput list-devices``.

source: To test it try
it_it: Per testarlo, provare

source: To test without SIMD, use e.g. ``cortex-m85+nomve``.
it_it: Per testare senza SIMD, si usa ad esempio ``cortex-m85+nomve``.

source: To trigger a gesture, two things need to happen.
it_it: Per attivare un gesto, devono verificarsi due cose.

source: To understand better what is going on, let's build the image like it is prepared for us
it_it: Per capire meglio cosa sta succedendo, creiamo l'immagine come se fosse stata preparata per noi

source: To understand it better take the example of a table.
it_it: Per capirlo meglio, prendiamo l'esempio di una tabella.

source: To unregister tests, use:
it_it: Per annullare la registrazione dei test, si usa:

source: To use DMA2D in your project now, set ``LV_USE_DRAW_DMA2D`` to ``1`` in ``lv_conf.h``.
it_it: Per utilizzare DMA2D nel progetto, si imposta ``LV_USE_DRAW_DMA2D`` a ``1`` in ``lv_conf.h``.

source: To use LVGL in Visual Studio, visit the `lvgl/lv_port_pc_visual_studio <https://github.com/lvgl/lv_port_pc_visual_studio>`__ repository.
it_it: Per utilizzare LVGL in Visual Studio, visitare il repository `lvgl/lv_port_pc_visual_studio <https://github.com/lvgl/lv_port_pc_visual_studio>`__.

source: To use a ``defconfig`` file, one can use the ``-DLV_DEFCONFIG_PATH=<path_to_defconfig>`` flag:
it_it: Per utilizzare un file ``defconfig``, è possibile utilizzare il flag ``-DLV_DEFCONFIG_PATH=<path_to_defconfig>``:

source: To use external files, you also need to convert the image files using the online converter tool, but select the binary output format.
it_it: Per utilizzare file esterni, è necessario convertire i file immagine utilizzando lo strumento di conversione online, ma selezionando il formato di output binario.

source: To use files in Image Widgets the following callbacks are required:
it_it: Per utilizzare i file nei Widget Image sono necessarie le seguenti callback:

source: To use it, add a Renesas project folder (with a `configuration.xml` file) to your workspace.
it_it: Per utilizzarla, si aggiunge una cartella di progetto Renesas (con un file `configuration.xml`) al proprio workspace.

source: To use it, extract it anywhere.
it_it: Per utilizzarlo, estrarlo ovunque.

source: To use one of these, add this line at the top of the .rst file if it is not already there:
it_it: Per utilizzarne uno, aggiungere questa riga all'inizio del file .rst, se non è già presente:

source: To use the *imgfont* in a label, reference it: :cpp:expr:`lv_obj_set_style_text_font(label, imgfont, LV_PART_MAIN)`
it_it: Per utilizzare *imgfont* in un'etichetta, si fa riferimento ad esso: :cpp:expr:`lv_obj_set_style_text_font(label, imgfont, LV_PART_MAIN)`

source: To use the LZ4 Decoder, enable it in ``lv_conf.h`` configuration file by setting either ``LV_USE_LZ4_INTERNAL`` or ``LV_USE_LZ4_EXTERNAL`` to ``1``.
it_it: Per utilizzare il decoder LZ4, abilitarlo nel file di configurazione ``lv_conf.h`` impostando ``LV_USE_LZ4_INTERNAL`` o ``LV_USE_LZ4_EXTERNAL`` a ``1``.

source: To use the RLE Decoder, enable it in ``lv_conf.h`` configuration file by setting :c:macro:`LV_USE_RLE` to ``1``.
it_it: Per utilizzare il decoder RLE, abilitarlo nel file di configurazione ``lv_conf.h`` impostando :c:macro:`LV_USE_RLE` a ``1``.

source: To use the SVG widget, additionally enable ``LV_USE_SVG``.
it_it: Per utilizzare il widget SVG, abilitare anche ``LV_USE_SVG``.

source: To use the ``FFmpeg`` library in your project, you will need to link against these libraries:
it_it: Per utilizzare la libreria ``FFmpeg`` in un progetto, si dovranno linkare queste librerie:

source: To use the driver in :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_PARTIAL` mode, an extra buffer must be allocated, preferably in the fastest available memory region.
it_it: Per utilizzare il driver in modalità :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_PARTIAL`, è necessario allocare un buffer aggiuntivo, preferibilmente nella regione di memoria più veloce disponibile.

source: To use the encoded file as a variable, choose one of these approaches:
it_it: Per utilizzare il file codificato come variabile, scegliere uno di questi approcci:

source: To use the module, just ``import pika_lvgl`` and the precompiler will automatically scan main.py and bind the ``pika_lvgl`` module.
it_it: Per utilizzare il modulo, basta ``import pika_lvgl`` e il precompilatore analizzerà automaticamente main.py e assocerà il modulo ``pika_lvgl``.

source: To use the symbol you will need to set the style's text font to use the generated font, e.g. :cpp:expr:`lv_style_set_text_font(&my_style, &my_font_name)` or :cpp:expr:`lv_obj_set_style_text_font(label, &my_font_name, 0)`.
it_it: Per utilizzare il simbolo, è necessario impostare il font del testo dello stile in modo che utilizzi il font generato, ad esempio :cpp:expr:`lv_style_set_text_font(&my_style, &my_font_name)` o :cpp:expr:`lv_obj_set_style_text_font(label, &my_font_name, 0)`.

source: To use them in a style, just add a pointer to a font variable like this:
it_it: Per utilizzarli in uno stile, basta aggiungere un puntatore a una variabile font in questo modo:

source: To use this Widget in multiple places in the code, the variable can be passed as a function parameter or made global.
it_it: Per utilizzare questo Widget in più punti del codice, la variabile può essere passata come parametro di funzione o resa globale.

source: To use vector fonts with ThorVG, you will have to enable ``LV_USE_VECTOR_GRAPHICS`` in ``lv_conf.h``
it_it: Per utilizzare font vettoriali con ThorVG, è necessario abilitare ``LV_USE_VECTOR_GRAPHICS`` in ``lv_conf.h``

source: To use vector graphics with NeoChrom, you should enable the following configs in ``lv_conf.h``.
it_it: Per utilizzare la grafica vettoriale con NeoChrom, è necessario abilitare le seguenti configurazioni in ``lv_conf.h``.

source: To utilize its power, ensure that ``mcpu`` is set to ``cortex-m85``, ``cortex-m55``, or ``cortex-m52`` and add the ``-fvectorize`` flag.
it_it: Per sfruttarne la potenza, assicurarsi che ``mcpu`` sia impostato su ``cortex-m85``, ``cortex-m55``, o ``cortex-m52`` e aggiungere il flag ``-fvectorize``.

source: To verify the library was installed, we can find it in the target sysroot:
it_it: Per verificare che la libreria sia stata installata, possiamo trovarla nella sysroot di destinazione:

source: To visually move a widget from its current position without changing its base coordinates:
it_it: Per spostare visivamente un widget dalla sua posizione attuale senza modificarne le coordinate di base:

source: To work with an operating system where tasks can interrupt each other (preemptively), you must ensure that no LVGL function call be called while another LVGL call is in progress.
it_it: Per lavorare con un sistema operativo in cui le attività possono interrompersi a vicenda (in modo preventivo), è necessario assicurarsi che nessuna chiamata di funzione LVGL venga chiamata mentre è in corso un'altra chiamata LVGL.

source: To work with lower :c:macro:`LV_MEM_SIZE` you can create Widgets only when required and delete them when they are no longer needed.
it_it: Per lavorare con :c:macro:`LV_MEM_SIZE` più bassi si possono creare Widget solo quando necessario ed eliminarli quando non lo sono più.

source: To zoom the chart all you need to do is wrap it in a parent container and set the chart's width and/or height to a larger value.
it_it: Per ingrandire il grafico, è sufficiente inserirlo in un contenitore padre e impostare la larghezza e/o l'altezza del grafico su un valore maggiore.

source: Toggle
it_it: Attiva/Disattiva

source: Toggle the subjects value when the trigger happens.
it_it: Scambia il valore dei "Subject" quando si verifica l'attivazione.

source: Toolchains
it_it: Toolchain

source: Tools
it_it: Tool

source: Top Layer (above Active Screen, transparent and neither scroll-able nor click-able)
it_it: Layer Superiore (sopra lo Schermo Attivo, trasparente e non scorrevole né cliccabile)

source: Top and System Layers
it_it: Layer Superiori e di Sistema

source: Toradex Examples
it_it: Esempi di Toradex

source: Toradex offers a wide range of system-on-modules (SoMs) and carrier boards designed for various applications and industries.
it_it: Toradex offre un'ampia gamma di System-on-Module (SoM) e schede carrier progettate per diverse applicazioni e settori.

source: Toradex provides a `VS Code extension <https://developer.toradex.com/torizon/application-development/ide-extension/>`_ that offers a collection of templates used to configure and automate the tasks needed to cross-compile applications and build Docker images.
it_it: Toradex fornisce una `Estensione VS Code <https://developer.toradex.com/torizon/application-development/ide-extension/>`_ che offre una raccolta di template utilizzati per configurare e automatizzare le attività necessarie per la cross-compilazione delle applicazioni e la creazione di immagini Docker.

source: Toradex specializes in manufacturing high-quality embedded computing solutions based on System on Module units (SoMs).
it_it: Toradex è specializzata nella produzione di soluzioni di elaborazione embedded di alta qualità basate su unità System-on-Module (SoM).

source: Torizon OS is an open-source software platform that aims to simplify the development and maintenance of embedded Linux software.
it_it: Torizon OS è una piattaforma software open source che mira a semplificare lo sviluppo e la manutenzione di software Linux embedded.

source: TorizonOS is a Linux-based operating system developed by Toradex, tailored for embedded systems.
it_it: TorizonOS è un sistema operativo basato su Linux sviluppato da Toradex, pensato appositamente per i sistemi embedded.

source: Touch Indev Creation
it_it: Creazione di un Touch Indev

source: Touch Pad: Resistive
it_it: Touchpad: Resistivo

source: Touch drivers are maintained in `esp-bsp repository <https://github.com/espressif/esp-bsp/tree/master/components/lcd_touch>`__ and are uploaded to ESP Registry
it_it: I driver touch sono mantenuti nel repository `esp-bsp repository <https://github.com/espressif/esp-bsp/tree/master/components/lcd_touch>`__ e vengono caricati nell'ESP Registry

source: Touch input rotation is handled accordingly.
it_it: La rotazione dell'input touch viene gestita di conseguenza.

source: Touchpad and Mouse
it_it: Touchpad e Mouse

source: Touchpad monkey example
it_it: Esempio di "touchpad monkey"

source: Trace logs are not being output
it_it: I log di trace non vengono stampati

source: Tracking whether a Widget still exists or has been deleted requires extra logic and can be tricky.
it_it: Verificare se un Widget esiste ancora o è stato eliminato richiede una logica aggiuntiva e può essere complicato.

source: Tracks:
it_it: Tracce:

source: Trademarks
it_it: Marchi

source: Transform Layer
it_it: Layer di Trasformazione

source: Transform Size
it_it: Trasformare la Dimensione

source: Transform object using a 3x3 matrix
it_it: Trasformare un oggetto usando una matrice 3x3

source: Transform style
it_it: Trasformazione di stile

source: Transformation will not be supported once with the blit split.
it_it: La trasformazione non sarà più supportata con la divisione blit.

source: Transformations
it_it: Trasformazioni

source: Transformations require the whole image to be available.
it_it: Le trasformazioni richiedono che l'intera immagine sia disponibile.

source: Transition
it_it: Transizione

source: Transitions
it_it: Transizioni

source: Transitions can be applied when the Widget changes state.
it_it: Le transizioni possono essere applicate quando il Widget cambia stato.

source: Translate Position
it_it: Traslazione della Posizione

source: Translate Strings
it_it: Traduzione di Stringhe

source: Translate on scroll
it_it: Traslazione durante lo scorrimento

source: Translation
it_it: Traduzione

source: Translations may be omitted --- fallbacks will be applied when needed.
it_it: Le traduzioni possono essere omesse: verranno applicati dei fallback [alternative] quando necessario.

source: Transparency
it_it: Trasparenza

source: Transparent Canvas with chroma keying
it_it: Canvas trasparente con chroma key

source: Transparent Screens
it_it: Screen Trasparenti

source: Transparent backgrounds for overlay effects
it_it: Background trasparenti per effetti di sovrapposizione

source: Triangle Draw Descriptor
it_it: Descrittore di Disegno del Triangolo

source: Triangle color.
it_it: Colore del triangolo.

source: Triangle drawing
it_it: Disegno di triangoli
